# 2. Напишите программу, которая определит позицию второго вхождения строки в списке либо сообщит, что её нет.

# *Пример:*

# - список: ["qwe", "asd", "zxc", "qwe", "ertqwe"], ищем: "qwe", ответ: 3
# - список: ["йцу", "фыв", "ячс", "цук", "йцукен", "йцу"], ищем: "йцу", ответ: 5
# - список: ["йцу", "фыв", "ячс", "цук", "йцукен"], ищем: "йцу", ответ: -1
# - список: ["123", "234", 123, "567"], ищем: "123", ответ: -1
# - список: [], ищем: "123", ответ: -1

test = [
    (["qwe", "asd", "zxc", "qwe", "ertqwe"], "qwe"),
    (["йцу", "фыв", "ячс", "цук", "йцукен", "йцу"], "йцу"),
    (["йцу", "фыв", "ячс", "цук", "йцукен"], "йцу"),
    (["123", "234", 123, "567"], "123"),
    ([], "123")
]


def FindSecondPosition(input: list, findValue: str) -> int:
    count = 0
    for i in range(len(input)):
        if input[i] == findValue:
            count += 1
        if count == 2:
            return i
    return -1


for _ in test:
    secondPosition = FindSecondPosition(_[0], _[1])
    if secondPosition == -1:
        print(f"В списке {_[0]} второго вхождения элемена {_[1]} нет")
    else:
        print(f"В списке {_[0]} второе вхождение элемена {_[1]}  - {secondPosition}")